PLEASE USE EXPLICIT PARAMETER FOR EACH METHOD/FUNCTION

In [1]:
#Pandas could be thought as python version of R/excel

In [2]:
# Pandas series: built on top of numpy array, very similar to it; 
# difference is series could be accessed by label

In [3]:
import pandas as pd
import numpy as np

In [4]:
### Please specify the paramter names in the following:
pd.Series()

# Please create a series with: a data list
pd.Series([1,2,3])
# Please create a series with: a data list and a index list
pd.Series(["a",2,3], index = [1,2,3])
# Please create a series with: a data np array and index list
pd.Series(np.array(["a",2,3]), index = [1,2,3])
# Please create a series with: a dictionary
pd.Series({"a":1, "b": 2})
# Select a values from a series by index
pd.Series({"a":1, "b": 2})["a"]
# Add up two series with mis-matching labels
pd.Series(np.array(["a",2,3]), index = [1,2,3]) + pd.Series(np.array(["a",2,3]), index = [4, 2,3])
# Sort a series(notice, you can't specify the column name in this case)
pd.Series(np.array([1,2,3]), index = [1,2,3]).sort_values()

1    1
2    2
3    3
dtype: int64

In [161]:
pd.DataFrame()

# Create a dataframe from a numpy matrix, specify the shared index, columns
tmp = pd.DataFrame([[1,2], [3,4]], index = ["a", "b"], columns = ["c", "d"])
# Select a column/row (two approaches: sql, bracket), check the type
tmp.c
tmp.loc["a"]
# Notice that we should always use bracket to select column, as sql approach could be messed up with method

# Create a new column; drop a existing column(notice the axis is required, but the 0/1 seems to be different to Andrew?
#; inplace is needed if the change is expected on the df)
tmp["e"] = 1
tmp.drop("e", axis = 1)
# Select a row/sub dataframe by function loc/iloc; remenber the difference
tmp.loc["a"]
tmp.iloc[1]
# Select dataframe values based on condition(column codition, row condition, etc.)
tmp[[col for col in tmp.columns]]

# Do logic operation on two series; notice "and" is not good here, has to use &
tmp

# Reset index, see what's going to happen

# Add a new column & set a new index by a list
tmp["f"] = 2
tmp.index = [1,2]
tmp
# Create a tuple list from two lists by "zip" function
zip([1,2], [3,4])
# Skip: higher index; the idea is using "xs" method

# Please create a random matrix [100, 5]
tmp = np.random.rand(100,5)
# Then random split a dataframe with 80/20 ratio, and take the last column as target
np.random.shuffle(tmp)
tmpp = pd.DataFrame(tmp)
# Please use iloc, loc and drop, in total 3 approaches
tmpp.drop(1, axis = 1).head()

          0         2         3         4
0  0.770200  0.845012  0.525624  0.807469
1  0.776827  0.963052  0.728709  0.492033
2  0.721603  0.924693  0.604385  0.057704
3  0.545786  0.456914  0.505174  0.551828
4  0.536287  0.824674  0.011090  0.331492

In [168]:
# Create a dataframe with null values; tips: use np.nan, and dictionary
pd.DataFrame([[np.nan] * 2 for x in range(2)])
# drop na by row/column with method

# fill na by row/column with method
pd.DataFrame([[np.nan] * 2 for x in range(2)]).fillna(1)
# fill na in a row, with mean
tp = pd.DataFrame([[np.nan] * 2 for x in range(2)])
tp.fillna(np.mean(tp))

    0   1
0 NaN NaN
1 NaN NaN

In [171]:
# Dataframe Group by a column, do an aggregation such as mean, sum, min
# tips: these would be 2 steps
# tips: try both string/numeric columns in dataframe and see groupby result
tmpp.drop(1, axis = 1).head().groupby(0).describe()
# do a groupby describe

             2                                                        \
         count      mean std       min       25%       50%       75%
0
0.536287   1.0  0.824674 NaN  0.824674  0.824674  0.824674  0.824674
0.545786   1.0  0.456914 NaN  0.456914  0.456914  0.456914  0.456914
0.721603   1.0  0.924693 NaN  0.924693  0.924693  0.924693  0.924693
0.770200   1.0  0.845012 NaN  0.845012  0.845012  0.845012  0.845012
0.776827   1.0  0.963052 NaN  0.963052  0.963052  0.963052  0.963052

                       3              ...                            4  \
               max count      mean    ...          75%       max count
0                                     ...
0.536287  0.824674   1.0  0.011090    ...     0.011090  0.011090   1.0
0.545786  0.456914   1.0  0.505174    ...     0.505174  0.505174   1.0
0.721603  0.924693   1.0  0.604385    ...     0.604385  0.604385   1.0
0.770200  0.845012   1.0  0.525624    ...     0.525624  0.525624   1.0
0.776827  0.963052   1.0  0.728709    ...     0.728709  0.728709   1.0


              mean std       min       25%       50%       75%       max
0
0.536287  0.331492 NaN  0.331492  0.331492  0.331492  0.331492  0.331492
0.545786  0.551828 NaN  0.551828  0.551828  0.551828  0.551828  0.551828
0.721603  0.057704 NaN  0.057704  0.057704  0.057704  0.057704  0.057704
0.770200  0.807469 NaN  0.807469  0.807469  0.807469  0.807469  0.807469
0.776827  0.492033 NaN  0.492033  0.492033  0.492033  0.492033  0.492033

[5 rows x 24 columns]

In [185]:
# Concatenate the following dataframes; try to concatenate with both row/columns
# Tips: image concatenate as glue, axis as the surface to be glued
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
#To memorize: concatenate has to input a list
print(np.concatenate([df1, df2], axis = 0))
print(pd.concat([df1, df2], axis = 0))

# Merge the following two dataframes, on "key", inner join
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})    

print(pd.merge(left, right,
        on = ["key"],
        how = "inner"))
# Join the following two dataframes, on index
# Notice: the difference between merging vs. joining: on column vs. on index 
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

print(left.join(right))

[['A0' 'B0' 'C0' 'D0']
 ['A1' 'B1' 'C1' 'D1']
 ['A2' 'B2' 'C2' 'D2']
 ['A3' 'B3' 'C3' 'D3']
 ['A4' 'B4' 'C4' 'D4']
 ['A5' 'B5' 'C5' 'D5']
 ['A6' 'B6' 'C6' 'D6']
 ['A7' 'B7' 'C7' 'D7']]
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3
     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [199]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

# Find unique values of col2; find #unique values in col2
print(df["col2"].drop_duplicates().shape)
# Count appearance of each value in col2; tips: use value_counts()
print(df["col2"].value_counts().loc[444])

def times2(x):
    return x*2
# Apply times2 to col2; notice times2 couldn't be directly used as its scalar input 
# Apply an equivalent times2 function with lambda function
df["col2"].apply(times2)
df["col2"].apply(lambda x: x*2)
# Show columns/index of a dataframe
df.columns
df.index
# Sort the datafrae by col2
df.sort_values(by = "col2")
# Count how many values are null in the dataframe? Tips: isnull()
df["col2"].isnull()
# Skip: use pivot_table to create multiple index table

(3,)
2

0    False
1    False
2    False
3    False
Name: col2, dtype: bool

In [10]:
# Read/Write a CSV file using pandas
 
# Read a excel file, specific sheet

# Read a html file using web scrapper with http://www.fdic.gov/bank/individual/failed/banklist.html

# Skip: read sql

In [11]:
# Weird cases: in some analysis, the following are different(here it's fine)
# In python 3.7, the "tmp.iloc[0][0]" is a copy of data, not the data itself, thus it'd not change
tmp = pd.DataFrame([[1,1], [2,1]])
tmp[0].iloc[0] = 4
tmp.iloc[0][0] = 4

你能把dataframe當sql用就可以了，select，sum，mean，agg，join，rank，sort這些sql都可以轉成df code

基本上是考aggregation, sort, case when。

In [1]:
#linkedin
import pandas as pd
data = pd.DataFrame({'view_date': ['2019-08-01', '2019-08-02', '2019-08-01', '2019-08-03'],
                     'viewer_id': [123, 432, 789, 567],
                     'article_id': [456, 543, 456, 780],
                     'author_id': [789, 654, 789, 432]
                    })

In [6]:
tmp = data.copy()
data

   article_id  author_id   view_date  viewer_id
0         456        789  2019-08-01        123
1         543        654  2019-08-01        123
2         456        789  2019-08-01        789
3         780        654  2019-08-01        567

In [9]:
pd.merge(tmp, data,
        left_on = ["author_id"],
        right_on = ["viewer_id"],
        how = "left")

,article_id_x,author_id_x,view_date_x,viewer_id_x,article_id_y,author_id_y,view_date_y,viewer_id_y
0,456,789,2019-08-01,123,456.0,789.0,2019-08-01,789.0
1,543,654,2019-08-01,123,NaN,NaN,NaN,NaN
2,456,789,2019-08-01,789,456.0,789.0,2019-08-01,789.0
3,780,654,2019-08-01,567,NaN,NaN,NaN,NaN

In [2]:
#Q1： How many members viewed more than one article on 2019-08-01?
tmp0 = data[["viewer_id", "article_id"]].drop_duplicates()\
.groupby(by = "viewer_id").agg(['count']) # 一定记住，都是quote!

tmp1 = data[["viewer_id", "article_id"]].drop_duplicates()\
.groupby(by = "viewer_id").agg(['count']).reset_index()

#Memorize: agg() takes either a dictionary or a list 
tmp2 = data[["viewer_id", "article_id", "author_id"]].drop_duplicates()\
.groupby(by = "viewer_id").agg({
    'article_id': ['mean', 'count'],
    'author_id': ['count']
}).reset_index()

print(tmp0[tmp0["article_id"]["count"] > 1].shape[0])

tmp2

0

  viewer_id author_id article_id
                count       mean count
0       123         1        456     1
1       432         1        543     1
2       567         1        780     1
3       789         1        456     1

In [3]:
#Q2： How many article authors have never viewed their own article?
data["viewer_id"].shape[0] - data[data.author_id == data.viewer_id]["viewer_id"].shape[0]

3

table 1 user_id|article_id|date
table2 article_id|article_type|
<br>
1) number of article types each user view on 2019-01-01 --- simple inner join and group by user<br>
2) histagram of the number of article types user viewed -- inner join and group by user and then group by number of article type

1. 各大洲里的几个国家的population，找到每个洲人口最多的国家名字及人口数量，用SQL，然后用Python。

第一题，经典的邮箱地址问题

经典题目Job posting, # of new job, # of repeated job, # of reactivate job

In [10]:
import pandas as pd
data = pd.DataFrame({'view_date': ['2019-08-01', '2019-08-01', '2019-08-01', '2019-08-01'],
                     'viewer_id': [123, 123, 789, 567],
                     'article_id': [456, 543, 456, 780],
                     'author_id': [789, 654, 789, 654]
                    }) 
tmp = data.groupby("author_id")
tmp.apply(lambda x: x.sort_values(by = "author_id"))

             article_id  author_id   view_date  viewer_id
author_id
654       1         543        654  2019-08-01        123
          3         780        654  2019-08-01        567
789       0         456        789  2019-08-01        123
          2         456        789  2019-08-01        789

In [211]:
data.author_id.drop_duplicates().shape[0] - \
data[data.viewer_id == data.author_id]["author_id"].drop_duplicates().shape[0]

1

In [11]:
data

   article_id  author_id   view_date  viewer_id
0         456        789  2019-08-01        123
1         543        654  2019-08-01        123
2         456        789  2019-08-01        789
3         780        654  2019-08-01        567

In [54]:
data[data.author_id == data.viewer_id]["author_id"].sort_values(ascending  = False)

2    789
Name: author_id, dtype: int64

In [71]:
data = pd.DataFrame({'user_id': [1, 1,2, 2, 3,3],
                     'view_date': ['2019-08-01', '2019-08-01', '2019-08-01', '2019-08-02', '2019-08-01', '2019-08-01'],
                     
                     'plat': ["mobile", "desktop", "mobile", "mobile", "desktop", "desktop"],
                     'amount': [100, 100,100, 100,100, 100]
                    })

In [72]:
data

   amount     plat  user_id   view_date
0     100   mobile        1  2019-08-01
1     100  desktop        1  2019-08-01
2     100   mobile        2  2019-08-01
3     100   mobile        2  2019-08-02
4     100  desktop        3  2019-08-01
5     100  desktop        3  2019-08-01

In [73]:

data

   amount     plat  user_id   view_date  mobil_spent  desktop_spent
0     100   mobile        1  2019-08-01          100              0
1     100  desktop        1  2019-08-01            0            100
2     100   mobile        2  2019-08-01          100              0
3     100   mobile        2  2019-08-02          100              0
4     100  desktop        3  2019-08-01            0            100
5     100  desktop        3  2019-08-01            0            100

    view_date  user_id  desktop_spent  mobil_spent
0  2019-08-01        1            100          100
1  2019-08-01        2              0          100
2  2019-08-01        3            200            0
3  2019-08-02        2              0          100

/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app
/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  app.launch_new_instance()

In [115]:
tmp

    view_date  user_id  desktop_spent  mobil_spent platform  total_spend
0  2019-08-01        1            100          100     both          200
1  2019-08-01        2              0          100    mobil          100
2  2019-08-01        3            200            0  desktop          200
3  2019-08-02        2              0          100    mobil          100

    view_date platform total_spend user_id
                               sum   count
0  2019-08-01     both         200       1
1  2019-08-01  desktop         200       1
2  2019-08-01    mobil         100       1
3  2019-08-02    mobil         100       1

In [111]:
tmp

    view_date  user_id  desktop_spent  mobil_spent platform
0  2019-08-01        1            100          100     both
1  2019-08-01        2              0          100    mobil
2  2019-08-01        3            200            0  desktop
3  2019-08-02        2              0          100    mobil

In [108]:
tmp["platform"][(tmp["desktop_spent"] == 0) & (tmp["mobil_spent"] > 0)] = "nwe"

/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [109]:
tmp

    view_date  user_id  desktop_spent  mobil_spent platform
0  2019-08-01        1            100          100     both
1  2019-08-01        2              0          100      nwe
2  2019-08-01        3            200            0     both
3  2019-08-02        2              0          100      nwe

In [91]:
tmp["mobil_spent"] == 0

0    False
1    False
2     True
3    False
Name: mobil_spent, dtype: bool

In [97]:
pd.Series(True) & pd.Series(True)

0    True
dtype: bool